{"class_name": "Model", "keras_version": "1.2.2", "config": {"output_layers": [["dense_6", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 400], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_1", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "input_dim": 400, "W_constraint": null, "batch_input_shape": [null, 400], "bias": true, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "b_constraint": null, "name": "dense_1", "output_dim": 100}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "input_dim": 100, "W_constraint": null, "batch_input_shape": [null, 100], "bias": true, "activation": "tanh", "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "b_constraint": null, "name": "dense_2", "output_dim": 50}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2"}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "input_dim": 50, "W_constraint": null, "batch_input_shape": [null, 50], "bias": true, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "b_constraint": null, "name": "dense_3", "output_dim": 25}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "dense_3"}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "input_dim": 25, "W_constraint": null, "batch_input_shape": [null, 25], "bias": true, "activation": "tanh", "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "b_constraint": null, "name": "dense_4", "output_dim": 50}, "inbound_nodes": [[["dense_3", 0, 0]]], "name": "dense_4"}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "input_dim": 50, "W_constraint": null, "batch_input_shape": [null, 50], "bias": true, "activation": "tanh", "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "b_constraint": null, "name": "dense_5", "output_dim": 100}, "inbound_nodes": [[["dense_4", 0, 0]]], "name": "dense_5"}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "input_dim": 100, "W_constraint": null, "batch_input_shape": [null, 100], "bias": true, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "b_constraint": null, "name": "dense_6", "output_dim": 400}, "inbound_nodes": [[["dense_5", 0, 0]]], "name": "dense_6"}], "name": "model_1"}}
